export const validateRules = {
    username: {
        required: "Логин обязателен."
    },
    email: {
        required: "Почта обязательна.",
        pattern: {
            value: /^(([^<>()[\]\\.,;:\s@"]+(\.[^<>()[\]\\.,;:\s@"]+)*)|(".+"))@((\[[0-9]{1,3}\.[0-9]{1,3}\.[0-9]{1,3}\.[0-9]{1,3}])|(([a-zA-Z\-0-9]+\.)+[a-zA-Z]{2,}))$/,
            message: "Неверный формат почты."
        }
    },
    password: {
        required: "Пароль обязателен.",
        pattern: {
            value: /(?=.*[A-Z])(?=.*[a-z])(?=.*[0-9])(?=.*[!@#$%^&*])/g,
            message: "Пароль должен содержать минимум одну заглавную букву, одну строчную букву, одну цифру и один спецсимвол."
        }
    }
}

export const validateOrderRules = {
   customerName: {
        required: "Полное имя обязательно.",
        pattern: {
            value: /(^[а-яА-ЯёЁ]{2,})[ ]([а-яА-ЯёЁ]{3,})[ ]([а-яА-ЯёЁ]{3,})$/,
            message: "Введите полное имя."
        }
    },
    phoneNumber: {
        required: "Номер телефона обязателен.",
        pattern: {
            value: /^\+7918[0-9]{3}[0-9]{2}[0-9]{2}$/,
            message: "Неверный формат номера телефона. Пример: +79180000000"
        }
    },
    postalCode: {
        required: "Индекс обязателен.",
        pattern: {
            value: /^[0-9]{6}$/,
            message: "Неверный формат индекса. Пример: 123456"
        }
    }
}